esp-cpp/espp/components/usb_device/xinput_example/sdkconfig.defaults
# This example uses the native USB-OTG peripheral, which is only available on the
# ESP32-S3 (also S2 / P4) -- NOT the classic ESP32. Pin the target here so a bare
# `idf.py build` does not fall back to esp32.
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Keep the console/logs on the built-in USB-Serial-JTAG so they stay separate
# from the native USB-OTG interface presented as the Xbox controller.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# The X-Input interface is served by usb_device's own custom TinyUSB application
# class driver, so NO built-in class driver is required: CDC, vendor and HID all
# stay disabled (0). Keeping the built-in vendor driver off also avoids it
# claiming the 0xFF interface. usb_device now compiles its CDC support
# conditionally (#if CFG_TUD_CDC), so an X-Input-only build needs no CDC at all.
CONFIG_TINYUSB_CDC_ENABLED=n
CONFIG_TINYUSB_CDC_COUNT=0
